KomplexKapharnaum/KXKM_Batterie_Parallelator/firmware-idf/sdkconfig.defaults
# ── Target ────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── Flash ─────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── PSRAM (N16R8 = 8MB Octal PSRAM) ──────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# ── Logging ───────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── FreeRTOS ──────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000

# ── Console sur USB-JTAG (BOX-3 connecté via USB interne) ─────────────
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ── Watchdog ──────────────────────────────────────────────────────────
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# ── OTA ───────────────────────────────────────────────────────────────
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_APP_PROJECT_VER="0.4.0"

# ── BSP BOX-3 display/touch (separe du bus BMU PMOD) ─────────────────
CONFIG_BSP_I2C_NUM=0
